vertexcovering.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Vertex Cover Benchmark Instances</title>
<!-- 2017-01-01 Sun 23:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="tnguyen@GiaoChi" />
<link rel="stylesheet" type="text/css" href="../Pub/solarized-light.css" />
</head>
<body>
<div id="content">
<h1 class="title">Vertex Cover Benchmark Instances</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Utils</a></li>
<li><a href="#sec-2">2. Vertex Cover instances</a></li>
<li><a href="#sec-3">3. Clique complement graphs</a></li>
<li><a href="#sec-4">4. Random Graphs</a></li>
<li><a href="#sec-5">5. Other Instances</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Utils</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="./instances/converter.tar.gz">Converter</a>: convert from benchmarks from <code>ascii</code> to <code>binary</code> format and vice versa.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Vertex Cover instances</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="./instances/vertex_cover/benchmarks/">Directory</a>, 
<a href="./instances/vertex_cover/benchmarks.tar.gz">tar.gz format</a>
</p>

<p>
From Ke Xu's website 
<a href="http://www.nlsde.buaa.edu.cn/~kexu/benchmarks/graph-benchmarks.htm"><a href="http://www.nlsde.buaa.edu.cn/~kexu/benchmarks/graph-benchmarks.htm">http://www.nlsde.buaa.edu.cn/~kexu/benchmarks/graph-benchmarks.htm</a></a>
</p>

<table id="tab:vc" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">File</th>
<th scope="col" class="right">Vertices</th>
<th scope="col" class="right">Max IS<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></th>
<th scope="col" class="right">Min VC</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left"><a href="./instances/vertex_cover/benchmarks/frb30-15-mis.tar.gz">frb30-15-mis (5 instances)</a></td>
<td class="right">450</td>
<td class="right">30</td>
<td class="right">420</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left"><a href="./instances/vertex_cover/benchmarks/frb35-17-mis.tar.gz">frb35-17-mis (5 instances)</a></td>
<td class="right">595</td>
<td class="right">35</td>
<td class="right">560</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left"><a href="./instances/vertex_cover/benchmarks/frb40-19-mis.tar.gz">frb40-19-mis (5 instances)</a></td>
<td class="right">760</td>
<td class="right">40</td>
<td class="right">720</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left"><a href="./instances/vertex_cover/benchmarks/frb45-21-mis.tar.gz">frb45-21-mis (5 instances)</a></td>
<td class="right">945</td>
<td class="right">45</td>
<td class="right">900</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left"><a href="./instances/vertex_cover/benchmarks/frb50-23-mis.tar.gz">frb50-23-mis (5 instances)</a></td>
<td class="right">1150</td>
<td class="right">50</td>
<td class="right">1100</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left"><a href="./instances/vertex_cover/benchmarks/frb53-24-mis.tar.gz">frb53-24-mis (5 instances)</a></td>
<td class="right">1272</td>
<td class="right">53</td>
<td class="right">1219</td>
</tr>

<tr>
<td class="right">7</td>
<td class="left"><a href="./instances/vertex_cover/benchmarks/frb56-25-mis.tar.gz">frb56-25-mis (5 instances)</a></td>
<td class="right">1400</td>
<td class="right">56</td>
<td class="right">1344</td>
</tr>

<tr>
<td class="right">8</td>
<td class="left"><a href="./instances/vertex_cover/benchmarks/frb59-26-mis.tar.gz">frb59-26-mis (5 instances)</a></td>
<td class="right">1534</td>
<td class="right">59</td>
<td class="right">1475</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Clique complement graphs</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="./instances/vertex_cover/clique_complement/">Directory</a>, 
<a href="./instances/coloring/vertex_cover/clique_complement.tar.gz">tar.gz format</a> 
</p>

<p>
From Muthubharathi Periannan's MS thesis at Penn State Harrisburg.
</p>

<ul class="org-ul">
<li><a href="./instances/vertex_cover/clique_complement/fileconverter.tar.gz">Clique to Vertex Cover</a> converter: converts graph instances for Max Clique into complement graphs, usable for Min Vertex Covering. The size of the minimum vertex cover is the difference between the total number of vertices and the size of the max clique.
</li>
</ul>


<table id="tab:complementclique" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">File</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left"><a href="./instances/vertex_cover/clique_complement/brock.tar.gz">brock</a></td>
</tr>

<tr>
<td class="right">2</td>
<td class="left"><a href="./instances/vertex_cover/clique_complement/C.tar.gz">C</a></td>
</tr>

<tr>
<td class="right">3</td>
<td class="left"><a href="./instances/vertex_cover/clique_complement/cfat.tar.gz">cfat</a></td>
</tr>

<tr>
<td class="right">4</td>
<td class="left"><a href="./instances/vertex_cover/clique_complement/gen.tar.gz">gen</a></td>
</tr>

<tr>
<td class="right">5</td>
<td class="left"><a href="./instances/vertex_cover/clique_complement/hamming.tar.gz">hamming</a></td>
</tr>

<tr>
<td class="right">6</td>
<td class="left"><a href="./instances/vertex_cover/clique_complement/johnson.tar.gz">johnson</a></td>
</tr>

<tr>
<td class="right">7</td>
<td class="left"><a href="./instances/vertex_cover/clique_complement/keller.tar.gz">keller</a></td>
</tr>

<tr>
<td class="right">8</td>
<td class="left"><a href="./instances/vertex_cover/clique_complement/MANN_a.tar.gz">MANN_a</a></td>
</tr>

<tr>
<td class="right">9</td>
<td class="left"><a href="./instances/vertex_cover/clique_complement/p_hat.tar.gz">p_hat</a></td>
</tr>

<tr>
<td class="right">10</td>
<td class="left"><a href="./instances/vertex_cover/clique_complement/san.tar.gz">san</a></td>
</tr>

<tr>
<td class="right">11</td>
<td class="left"><a href="./instances/vertex_cover/clique_complement/sanr.tar.gz">sanr</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Random Graphs</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="./instances/vertex_cover/random_graphs/">Directory</a>, 
<a href="./instances//vertex_cover/random_graphs.tar.gz">tar.gz format</a>
</p>

<p>
From Muthubharathi Periannan's MS thesis at Penn State Harrisburg.
</p>

<table id="tab:random" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">File</th>
<th scope="col" class="right">Vertices</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left"><a href="./instances/vertex_cover/random_graphs/graph50.tar.gz">random graphs with  50 vertices - 10 instances</a></td>
<td class="right">50</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left"><a href="./instances/vertex_cover/random_graphs/graph100.tar.gz">random graphs with 100 vertices - 10 instances</a></td>
<td class="right">100</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left"><a href="./instances/vertex_cover/random_graphs/graph200.tar.gz">random graphs with 200 vertices - 5 instances</a></td>
<td class="right">200</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left"><a href="./instances/vertex_cover/random_graphs/graph250.tar.gz">random graphs with 250 vertices - 5 instances</a></td>
<td class="right">250</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left"><a href="./instances/vertex_cover/random_graphs/graph500.tar.gz">random graphs with 500 vertices - 5 instances</a></td>
<td class="right">500</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Other Instances</h2>
<div class="outline-text-2" id="text-5">
<dl class="org-dl">
<dt> BHOSLIB </dt><dd>Benchmarks with Hidden Optimum Solutions for Graph Problems (Maximum Clique, Maximum Independent Set, Minimum Vertex Cover and Vertex Coloring): <a href="http://www.nlsde.buaa.edu.cn/~kexu/benchmarks/graph-benchmarks.htm"><a href="http://www.nlsde.buaa.edu.cn/~kexu/benchmarks/graph-benchmarks.htm">http://www.nlsde.buaa.edu.cn/~kexu/benchmarks/graph-benchmarks.htm</a></a>
</dd>
</dl>


<hr  />

<p>
<a href="./index.html">Back to benchmark instances page</a>
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
IS: indepdent set
</p></div>


</div>
</div></div>
</body>
</html>
